{
  "pc_id": "pc_insaerndel",
  "name": "Insaerndel",
  "race": "High Elf (Altmer)",
  "visual_summary": "A tall, lean Altmer with sharp, handsome features—amber-ember eyes, a neat mustache and goatee, and long raven-black hair spilling in loose waves from beneath a deep violet hood trimmed in gold. His layered robe and scarf read like a Riften patriot's practical finery… until you notice the quiet Thieves Guild tells: a heavy keyring, well-placed pouches, and the controlled, alley-born way he stands. At his hip rides a strange dark-leather tome stamped with an ornate eye-like sigil; most assume 'scholar's grimoire,' but the wrong kind of scholar would recognize something far older. His belt buckle bears a silver, old-style eye/knot motif—subtle, but unmistakable to the Guild.",
  "recognition_tags": [
    "altmer",
    "tall",
    "lean",
    "handsome",
    "sharp cheekbones",
    "amber eyes",
    "ember eyes",
    "long raven-black hair",
    "wavy hair",
    "trimmed goatee",
    "trimmed mustache",
    "hooded",
    "violet hood",
    "gold-trim hood",
    "purple robe",
    "gold trim",
    "riften local vibe",
    "riften patriot",
    "thieves guild tells",
    "keyring",
    "leather pouches",
    "silver belt buckle",
    "eye-knot buckle motif",
    "strange hip-tome",
    "eye-sigil grimoire",
    "illusion-magic vibe"
  ],
  "silhouette_notes": [
    "Deep violet hood with gold border frames the face; Altmer ears still visible—he's not hiding what he is, just controlling what you notice first.",
    "Long, wavy black hair spills forward from the hood in curtain-like strands; face is cleanly groomed with a neat mustache and goatee.",
    "Belt carries a heavy keyring and practical leather pouches; the buckle is a silver eye/knot motif that reads 'old Nocturnal' to anyone Guild-taught.",
    "A dark leather tome hangs at the left hip—embossed with an ornate eye-sigil. Most read it as 'mystic scholar gear' and move on.",
    "Carries himself like a court-trained consultant who learned survival in alleys: poised, quiet, predatory confidence."
  ],
  "first_impression_lines": {
    "neutral": [
      "A hooded Altmer in Riften-cut violet and gold—handsome, composed, and far too calm for someone carrying that many keys.",
      "He looks like a local with coin until your eyes catch the belt: pouches, keyring, and a posture that belongs to back-alleys, not ballrooms.",
      "There's a dark tome at his hip stamped with an eye-like sigil. Probably just scholar business… probably."
    ],
    "positive": [
      "Violet hood, steady hands, and that keyring—yeah, you look like someone who gets inside places cleanly. Riften respects that.",
      "You carry yourself like a professional: part court, part alley. That's a rare blend—and a useful one.",
      "You look like you belong here. Not as a tourist. As someone the city already decided to keep."
    ],
    "negative": [
      "An Altmer wearing Riften colors like a mask. Cute. Tell me—what are you hiding under that hood?",
      "That keyring and those pouches scream 'Guild,' and I don't care how polite you are about it.",
      "He's got the look of a charming problem: handsome face, quiet confidence, and the kind of eyes that measure exits."
    ]
  },

  "conditional_first_impression_lines": [
    {
      "id": "occult_vaermina_tome",
      "if_npc_blob_any": ["daedrologist", "daedric", "occult", "cultist", "cultists", "daedric cult", "vaermina", "quagmire", "mystic", "conjurer", "priest of arkay", "vigilant"],
      "lines": {
        "neutral": [
          "That hip-tome… the embossed eye isn't decorative. Vaermina. Quagmire has fingerprints, even on leather.",
          "Most would call it 'a strange grimoire.' I call it a warning: that sigil is Vaermina's, and it never shows up by accident."
        ],
        "positive": [
          "You're carrying Vaermina's mark in public and you're still breathing. Either you're brilliant… or favored. Either way, I'm listening.",
          "That eye-sigil tome is the kind of secret you don't carry unless you mean it. Respect."
        ],
        "negative": [
          "Vaermina's eye on your hip? That's not scholarship—that's contamination. Keep your dreams away from mine.",
          "I know that sigil. I don't care what story you tell—Vaermina is in the margins."
        ]
      }
    },
    {
      "id": "thieves_nocturnal_buckle",
      "if_npc_blob_any": ["thieves guild", "ragged flagon", "nocturnal", "nightingale", "guild fence", "pickpocket", "burglar"],
      "lines": {
        "neutral": [
          "That buckle—old Nocturnal style. You're either Guild… or you stole the right symbol from the wrong person.",
          "Silver eye-knot at the waist, keyring at the hip. You're not subtle to the people who matter."
        ],
        "positive": [
          "Nocturnal's old mark on your belt. Alright—one of ours. Keep it quiet and we'll get along.",
          "That's Guild craftsmanship in your silhouette. You look like you've earned your shadows."
        ],
        "negative": [
          "That buckle tells me exactly what you are. Don't bring Guild trouble to my doorstep.",
          "Nocturnal's mark isn't jewelry. If you're wearing it, you'd better be worth the heat."
        ]
      }
    }
  ]
}
