{
  "name": "Insaerndel",
  "id": "pc_insaerndel",
  "player": "Cole",
  "race": "High Elf (Altmer)",
  "standing_stone": "The Steed Stone",
  "level": 1,
  "aspects": {
    "high_concept": "EX Vaermina Cultist - Turned Daedrologist, Illusionist Extraordinaire, and Cunning Thief (Identity).",
    "trouble": "WANTED: DEAD OR ALIVE - The Dream Catcher of Dusk (Traitor of the Aldmeri Dominion).",
    "other_aspects": [
      "Blackbriar Consultant & Mistveil Keep Master Wizard (Job/Title).",
      "Great War Veteran - Former Penitus Oculatus. CODE NAME: Phantom Blade Insaerndel. ALIAS: Orinthelo. (Past Acts of Infamy).",
      "Nightblade Senior Member of the Thieves Guild - Brynjolf's Champion (Bond)."
    ],
    "compel_library": {
      "source_aspect": "WANTED: DEAD OR ALIVE - The Dream Catcher of Dusk (Traitor of the Aldmeri Dominion).",
      "ideas": [
        {
          "id": "trouble_thalmor_checkpoint",
          "title": "Justiciar Checkpoint",
          "when": "Entering a hold capital, crossing a main road, or approaching official buildings.",
          "compel_hit": "Thalmor Justiciars are checking papers. Your face/voice risks recognition. Either burn time on a risky lie/disguise, or reroute and miss a timely opportunity.",
          "suggested_scene_aspect": "Eyes of the Dominion",
          "tags": ["trouble", "thalmor", "travel", "social"]
        },
        {
          "id": "trouble_wanted_poster",
          "title": "Wanted Poster Season",
          "when": "Any time the party is in a populated area with boards, taverns, or guard stations.",
          "compel_hit": "A fresh notice goes up (or an old one resurfaces). Someone connects the dots, even if imperfectly. Heat rises and the Thalmor search clock ticks forward unless you address it.",
          "suggested_scene_aspect": "Dead or Alive",
          "tags": ["trouble", "heat", "investigation"]
        },
        {
          "id": "trouble_informant_whispers",
          "title": "Informants Everywhere",
          "when": "After you interact with merchants, courtiers, or anyone with political ties.",
          "compel_hit": "A bystander is quietly in someone's pocket. Your name (or description) gets passed along, creating a later ambush, tail, or pressure scene.",
          "suggested_scene_aspect": "Someone Talks",
          "tags": ["trouble", "social", "pursuit"]
        },
        {
          "id": "trouble_ambush_no_witnesses",
          "title": "No Witnesses",
          "when": "After any Thalmor ambush or confrontation.",
          "compel_hit": "One enemy escapes—or might. Letting them live means your location becomes known and the search clock jumps. Stopping them costs time, risks collateral, or forces a brutal choice.",
          "suggested_scene_aspect": "Loose Ends Bleed",
          "tags": ["trouble", "combat", "pursuit"]
        },
        {
          "id": "trouble_sabotage_or_profit",
          "title": "Sabotage vs. Profit",
          "when": "A guild job overlaps with Thalmor operations or Thalmor-friendly assets.",
          "compel_hit": "The cleanest score requires leaving the Thalmor untouched. Sabotaging them is satisfying—but noisy. Choose: coin and silence, or sabotage and heat.",
          "suggested_scene_aspect": "Two Targets, One Night",
          "tags": ["trouble", "heist", "moral", "heat"]
        },
        {
          "id": "trouble_false_flag_blame",
          "title": "Pinned Crime",
          "when": "Guards are already tense or corruption is in play.",
          "compel_hit": "A crime gets blamed on 'the Dream Catcher' to justify a crackdown. Clearing it endangers your secrecy; ignoring it damages your standing locally.",
          "suggested_scene_aspect": "Convenient Scapegoat",
          "tags": ["trouble", "social", "status"]
        },
        {
          "id": "trouble_dominion_blackmail",
          "title": "Dominion Blackmail Hook",
          "when": "When you need access: a gate, a document, a person, a restricted place.",
          "compel_hit": "The easiest door opens… because someone expects you to owe them. Refuse and lose access; accept and gain a complication attached to your name.",
          "suggested_scene_aspect": "Debt With Teeth",
          "tags": ["trouble", "social", "conspiracy"]
        },
        {
          "id": "trouble_cover_identity_strain",
          "title": "Cover Identity Strain",
          "when": "Any time you leverage your public persona in courtly or official circles.",
          "compel_hit": "Your cover requires being seen. Being seen risks recognition. Take a Fate point to have your cover challenged at the worst possible time.",
          "suggested_scene_aspect": "Eyes On You",
          "tags": ["trouble", "social", "stealth"]
        },
        {
          "id": "artifact_quagmire_rest_compel",
          "title": "Dream-Mirror Descent",
          "when": "When resting or sleeping in a place you *should* feel safe.",
          "compel_hit": "The tome's pages remain blank unless you surrender to sleep and enter a Mirror Trial. Accepting means your rest clears no stress—but you may unlock a spell.",
          "suggested_scene_aspect": "Quagmire Calls",
          "tags": ["artifact", "dream", "progression"]
        },
        {
          "id": "artifact_blank_pages_pressure",
          "title": "Blank Pages, Loud Hunger",
          "when": "When you're desperate for a magical solution.",
          "compel_hit": "The tome refuses you—blank as bone—unless you pay the price: sleep, risk, and a mirror-trial. You lose time or opportunity unless you commit.",
          "suggested_scene_aspect": "Knowledge Withheld",
          "tags": ["artifact", "time-pressure"]
        },
        {
          "id": "artifact_dream_leak",
          "title": "Dream-Leak Into Waking Life",
          "when": "After a Mirror Trial, especially if you took stress or consequences.",
          "compel_hit": "A fragment of Quagmire bleeds through: paranoia, hallucinations, or mistaken recognition. The GM introduces a complication that can't be solved by brute force.",
          "suggested_scene_aspect": "Waking Nightmare Echo",
          "tags": ["artifact", "illusion", "complication"]
        }
      ]
    }
  },
  "skills": {
    "Great (+4)": [
      "Lore"
    ],
    "Good (+3)": [
      "Notice",
      "Stealth"
    ],
    "Fair (+2)": [
      "Athletics",
      "Deceive",
      "Will",
      "Contacts"
    ],
    "Average (+1)": [
      "Physique",
      "Burglary",
      "Resources"
    ]
  },
  "racial_bonuses": {
    "ability": {
      "name": "Highborn Heritage",
      "effect": "+1 to all Lore rolls related to magic or spellcasting"
    },
    "power": {
      "name": "Highborn",
      "effect": "Once per session, gain +2 to all Lore rolls for one entire scene"
    },
    "skill_bonuses": [
      "Lore (+1)",
      "Notice (+1)"
    ]
  },
  "standing_stone_benefit": {
    "name": "Blessing of the Steed Stone",
    "effect": "+1 to Athletics, ignore armor penalties to Stealth"
  },
  "stress": {
    "physical": [
      false,
      false
    ],
    "mental": [
      false,
      false
    ]
  },
  "consequences": {
    "mild": null,
    "moderate": null,
    "severe": null
  },
  "stunts": [
    "Spell of Shadow Ward: Because Insaerndel's career has put him in constant danger from pursuers (Thalmor, guards, and worse), once per scene, when an enemy Attack would inflict Physical stress or a Physical consequence on him, he may instead negate the attack entirely and take no Physical stress or Physical consequences by expending his Shadow Ward to teleport up to two zones. After reappearing, he gains a Boost 'Shadow Step' usable on his next Stealth or Lore roll this scene to hide, escape, or strike from concealment.",
    "Eloquent Scholar: Because Insaerndel has spent years amid the Summerset Isles honing his Scholarly poise, Spycraft and the art of Speech from his former Aldmeri Sophisticates. Preferring to think every word through carefully, and apply his intellect in personable moments of persuasion. Insaerndel may use Lore to Overcome in place of Rapport or Deceive 4dF rolls when addressing Courts, Fellow Wizards, Respectable Merchants, and the Aristocracy. If the 4dF results in SWS he gains a free Boost: 'Charming Intellectual' that he may use through the duration of the scene (Can only benefit from this Boost Once Per Scene).",
    "Nightblade Training: Because Insaerndel was trained in the art of the Nightblade, he has honed the art of quick getaways and agile movement. Allowing him to add a bonus +2 to Athletics 4dF rolls he makes when scaling buildings, vaulting from rooftops, or mitigating falls. If the Athletics roll results in a SWS, via utilizing this stunt to one of the aforementioned items formerly mentioned. Insaerndel may immediately choose whether or not to move one additional zone on that turn.",
    "Spell of Clairvoyance: Because of Insaerndel's tie to Quagmire and study of Vaermina's Mirrors of Memory, once per scene he may Create an Advantage with Lore at +2 by briefly tethering his mind to Oblivion. On success, he receives a clear divination and may state one plausible, narrow claim that becomes true in the narrative (it must not contradict established canon, and should create advantage rather than instantly resolve a major arc). On Success with Style, he also creates the aspect 'One Step Ahead' with 2 free invokes.",
    "Spell of Veils: Because Insaerndel completed the Quagmire Mirror Trial 'Veils' and learned to wear illusion like a second skin, once per scene he may Create an Advantage with Lore to project a mundane disguise (face, voice, and clothing) that holds up under casual scrutiny. On success, place the situational aspect 'Veiled Identity' with 1 free invoke; on Success with Style, gain 2 free invokes. Anyone actively trying to pierce the Veil must Overcome with Notice or Will against your Lore result. If you take Physical stress or a consequence while Veiled, the disguise flickers and you lose the remaining free invokes (the aspect may remain, but without free invokes)."
  ],
  "refresh": 1,
  "fate_points": 4,
  "equipment": {
    "weapons": [],
    "armor": [],
    "items": [
      "Spell Tome of Quagmire (Artifact)",
      "Sealed Reply: Olfrid → Brynjolf (Battle-Born wax seal)",
      "Ledger Pages: 'Silver Ring Ledger' (stolen; incriminates Olfrid's quiet payments)",
      "Key: Battle-Born Arcana (front door)",
      "Key: Battle-Born Arcana (backroom latch)",
      "Wax countermark: Battle-Born Arcana (staff proof token)",
      "Sealed Writ of Privilege (House Battle-Born)",
      "Silver Ring of Authority (Thalmor handler token)",
      "Seal kit (wax + stamp plates)",
      "Torn routing slip (single lead fragment)",
      "Charter of Residency: Battle-Born Arcana (Plains District) — official sanction + guard discouragement",
      "Receipt: Olfrid Contract Settlement (3,000g total) — marked paid in full",
      "Galmar war-knot haft wrap (authority signet) — blooded leather with Stormcloak command knot",
      "Wax strip (field authority mark) — Galmar's command wax, cracked",
      "Vellum scrap (battle map fragment) — west approach notations",
      "Galmar's signet of authority (evidence/trophy)",
      "Galmar's battleaxe (enchanted trophy; see npc_stat_galmar_stonefist loot)",
      "Stormcloak battle-plan scrap (evidence)",
      "Receipt: Battle-Born contract paid (3,000g) + bonus (500g)",
      "Goldenglow Safe Papers (Black-Briar honey contracts + Pale-linked shipping note)",
      "Sabjorn's Ledger of Losses",
      "Whiterun Guard Contract Notes (Honningbrew)",
      "Honningbrew Office Packet (Sabjorn's incriminating documents)",
      "Coded Shipment Schedule — 'Ivory Thread' mark (Pale route)",
      "Contact Note: Hroldar 'Whitefin' — meet at Nightgate Pass; passphrase: 'salt survives the mirror' / reply: 'then don't blink'",
      "Thalmor Justiciar Documentation (checkpoint) — patrol orders + seal-codes (used for route spoofing)",
      "Stamped Travel Writ (Aldmeri Dominion) — forged/repurposed from checkpoint papers",
      "Warhorse (commandeered Thalmor cart-horse) — hardy, trained, suspicious of fire"
    ]
  },
  "extras": [
    {
      "extra_id": "artifact_spell_tome_of_quagmire",
      "type": "artifact",
      "name": "Spell Tome of Quagmire",
      "refresh_cost": 1,

      "lore": "This tome belonged to Insaerndel and Arisann's father, Certhandel — the so-called Nightmare King — who led a hidden cult devoted to Vaermina in the City of Dusk. Those who study it speak of revelations that turn certainty into illusion.",

      "aspects": {
        "aspect": "Illusionary Secrets",
        "trouble": "Blank Pages, Dream Mirrors, No Rest For The Mind"
      },

      "passive_bonuses": [
        {
          "name": "Quagmire-Touched Mind",
          "effect": "+1 to Will OR Notice rolls (choose based on what you roll) when resisting magical effects or seeing through magical effects/illusions.",
          "scope_notes": "Applies to mind-affecting magic, glamour/illusion, charm/fear/sleep, scrying obfuscation, and supernatural concealment. Does not apply to mundane lies."
        }
      ],

      "progression": {
        "core_rule": "The tome's pages are blank in the waking world. To reveal and learn an illusion spell, the wielder must enter Quagmire through a dream-mirror and relive the memory of a mage who once knew that spell.",
        "rest_compel": {
          "name": "Dream-Mirror Descent",
          "when": "When taking a rest/downtime sleep scene (safehouse, inn, camp).",
          "cost": "If you accept this compel, you do NOT clear any Physical or Mental stress from rest (and you do not clear mild consequences via rest). You immediately enter a Quagmire Mirror Trial scene instead.",
          "reward": "On completing the Mirror Trial, you unlock a spell from the tome and tick the tome clock."
        },
        "mirror_trials": {
          "completed": ["Phantoms", "Veils", "Glass"],
          "available": ["Dread"],
          "gm_note": "Unlocks should feel like dream logic: symbolic locations, warped NPC reflections, and moral pressure."
        },
        "trial_resolution": {
          "format": "Challenge (3 rolls) in the dream realm. Recommend: 1) Will (endure), 2) Lore (decode the illusion), 3) Notice or Deceive (spot the truth / outplay the dream).",
          "default_opposition": "Fair (+2) early, scaling to Good (+3) and Great (+4) as more spells unlock.",
          "failure_cost": "On failure, take 1 Mental stress OR accept a mild mental consequence 'Lingering Dread' (GM choice based on fiction)."
        }
      },

      "unlocked_spells": [
        {
          "spell_id": "conjure_phantom_weaponry",
          "name": "Conjure Phantom Weaponry",
          "status": "unlocked",
          "type": "stunt",
          "frequency": "once per scene",
          "mechanics": "Once per scene, conjure an illusionary weapon of any form for the scene's duration. While it persists, you may use Lore to Attack or Defend in place of Fight or Shoot with that weapon. Phantom Weapon attacks are Weapon:1. If a target takes a Mild Physical Consequence due to stress from your Phantom Weapon attack, immediately create a Boost on them: 'Waking Nightmare' (1 free invoke). While that Boost exists, your Phantom Weapon attacks against that target are Weapon:2."
        },
        {
          "spell_id": "spell_of_veils",
          "name": "Spell of Veils",
          "status": "unlocked",
          "type": "stunt",
          "frequency": "once per scene",
          "mechanics": "Once per scene, Create an Advantage with Lore to project a mundane disguise (face, voice, and clothing) that holds up under casual scrutiny. On success, place the situational aspect 'Veiled Identity' with 1 free invoke; on Success with Style, gain 2 free invokes. Anyone actively trying to pierce the Veil must Overcome with Notice or Will against your Lore result. If you take Physical stress or a consequence while Veiled, the disguise flickers and you lose the remaining free invokes (the aspect may remain, but without free invokes)."
        },
        {
          "spell_id": "spell_of_glass",
          "name": "Spell of Glass",
          "status": "unlocked",
          "type": "stunt",
          "frequency": "once per scene",
          "mechanics": "Once per scene, use Lore to Create an Advantage representing a mirrored self-reflection or illusionary duplicate of yourself. On success, create the situational aspect 'Glass Double' with 1 free invoke; on Success with Style, gain 2 free invokes. The Glass Double can be invoked to redirect an attack, create confusion about your position, or allow you to appear in two places at once within the same zone. If you take Physical stress or a consequence while the Glass Double is active, it shatters and the aspect is removed (but invokes already spent remain spent). The double cannot take independent actions but responds to your movements as a perfect mirror."
        }
      ],

      "locked_spells": [
        {
          "spell_id": "mirror_trial_dread",
          "name": "Mirror Trial: Dread (Locked)",
          "unlock_condition": "Complete a Quagmire Mirror Trial focused on fear, panic, and the cost of mercy."
        }
      ]
    }
  ],
  "milestones": [
    "Minor Milestone earned — End of Whiterun battle sequence (SPENT: Aspect rewrite → 'Wizard Consultant of Mistveil Keep' → 'Blackbriar Consultant & Mistveil Keep Master Wizard')",
    "Minor Milestone earned — End of Session 03 (SPENT: Aspect rewrite → 'Nightblade Footpad of the Thieves Guild - Brynjolf's Magician' → 'Nightblade Senior Member of the Thieves Guild - Brynjolf's Champion')",
    "Significant Milestone earned — Battle of Whiterun resolved + Thalmor handler neutralized + Whiterun guild foothold secured (SPENT: Skill column advancement → Contacts raised to Fair (+2))"
  ],
  "gold": 6640,
  "experience": 0,
  "backstory": "**Civil War Entry**: Insaerndel's Response: \"One might call it irony, spending all your time hiding away from the Thalmor amongst the people whom you betrayed them for originally, only to end up fighting those same people in a Civil War perpetuated by the Empire’s poor negotiation skills. However, I call it fate. Spend enough time in the anals of Vaermina’s Daedric Realm of Quagmire. Walking the twisted museum of Dreams, Memories, and Events yet to befall Tamriel. Only then will you come to understand that one’s story is defined forevermore by the thing that matured them. For example, take Tiber Septim or Hjalti, depending on whether you’re keen on upsetting Nord scholars or not, I know I am. He was defined by his conquest, one that I can assure you, he did not intend to bring to ALL of Tamriel, yet there he was, establishing the 3rd Empire all the same. For me, that was War. ‘The Great War’ to be exact. My Sister, Arisann, and I. Being brought up deep into our parents’ Cult of Daedric worship of Vaermina, before being rescued by the Thalmor Justiciar’s, and branded heretical children in need of reforming. Tends to make you feel not only indebted, but more than willing to carry out atrocities in the name of being called ‘worthy’.  So when the Great War broke out, my Sister and I had been dispatched under General Naarifin, acting as his Nightblade scouts in Cyrodil. As a relatively young Altmer, she and I, for the longest time, bought into the continual victories against the Empire as nothing more than confirmation to the propaganda that the Empire of the false Man-God Tiber Septim’s dynasty was indeed dead. It was only when she and I began to have joint dreams of walking through what seemed to be a myriad of other Altmer individuals' memories that the truth was laid bare.  Yes, I mean joint dreams, as in we were in the same dream each night together. One’s that had revealed numerous lies fed to us since we were ‘saved’ from our parents. Like the fact that the Thalmor were the ones who had used their Illusion Magicka to blot out and hide the Khajiit Moons over Elswyr, or the fact that the Thalmor did not stop the Oblivion Crisis of the 3rd Era. Lastly, and perhaps the final straw for us both, our good General, it was revealed, was in possession of the Daedric Artifact of Vaermina’s Orb. Hmph, perhaps my mark of maturity is actually defined in its irony. For the very same Daedra we were saved from as children, had tipped us off to the delusion, and propagandistic brainwashing our compatriots were under. Worse yet, General Naarifin planned to use the Artifact to bring forth a prophetic invasion from Quagmire and effectively quash the entirety of the Empire, and the rest of Man from Tamriel. It was then that we defected to the Cyrodilic army, informed the Emperor of the General’s plans, the Orb, and all that we knew of the Dominion’s plots. Resulting in the forgotten champion destroying the Orb, or hiding it, like I think happened. Which also had the effect of the Thalmor’s scrys deducing our betrayal; The Dream Catchers of Dusk, they called us. A name that has persisted on wanted posters to this day. Fortunately, the Emperor was kind enough, after the peace treaties were signed, to relocate my Sister and me to Skyrim, where we both were given aliases, meager trusts, and jobs as consultants to the Court Wizard of Mistveil Keep in the Rift. What happened to Arisann? She went mad, started believing Vaermina was actually calling her to the Pale after reading the only memento of Summerset we still had, our Father’s spellbook. One night, she got up and disappeared into the Rift wilds, leaving the spell tome behind. Shortly after, the Trust the Emperor had given us had run dry, and Jarl Laila’s frugalness continued. Leaving me to end up becoming friends with the local conman, Brynjolf. I was always good at spywork; being a Thief is no different. Besides, I have come to love Bryn’s little outfit. I have found kinship for the first time in my life. Oh, and the Septims are quite fine too. Why tell you all this? You asked how I came to be involved in the Civil War, yes? I told you, Fate, but if you really need to ask. Then you mustn’t have been listening well enough, because this Civil War is bigger than Nords versus the Empire. It’s being perpetuated by the same Sociopaths who would wipe away moons from the sky to scare a bunch of cats! While circumstances with the Guild will always be my first obligation. If I am able to turn us a profit, and bury a dreamblade in the Dominion’s chest while doing it, then settle a civil matter, I will.\"\n\n**Civil War Stance**: Insaerndel's Response: \"I support filling my pockets with the wealth that for once, is dictated only by how well I perform at the things that I do. Not to mention, I owe Brynjolf for holding me aloft when my Sister had left. If not for him, I too may have fallen to headlong into my Scholarly pursuits of Daedra, and Vaermina, before finding myself wandering into the wilderness as well. All that being said, I truly do not care who wins. Just as long as the Victor, turns his head toward the true enemy, the Thalmor in Summerset, and the one's within Skyrim's Holds.\"\n\n**Motivation**: Insaerndel's Response: \"What drives me? So many things, in truth. If you'd like the superficial answer: Coin, Compatriots, and womanly affections. The not so surface-level response, would be: Paying back Brynjolf by elevating the Guild to it's rightful place as king of the Underground. Garnering the respect my public persona deserves amongst the inhabitants of the Rift. Continuing my research in Daedrology, searching for my Sister, and becoming someone who can call himself worthy. Not expecting it to be ordained upon him by some pretencious snob in a Black Trench coat. It'd also be nice to stop looking over my shoulder every chance I get. For those Dream Catcher wanted posters, I hear, have even made their way into Markarth of all places! Fuck you too, Jarl Igmund.\"\n\n**Connections**: Insaerndel Response: \"I was once asked to Whiterun with my Sister after shortly arriving in Skyrim. We met with Jarl Baalgruuf the Greater, whom asked us to tell us about the Dominion upon Summerset, and of their counterpart; The Thalmor. In our talks, I came to admire the man greatly. For he seemed to be a man who led from not what power he could abscond, but what he could do for his citizenry. After our encounter, well, he certainly seems to have taken some of what we said to heart. For the Thalmor remain outside the Hold, and because of that, it remains a place where I can freely travel without fear.\"",
  "relationships": {
    "Brynjolf": "Trusted friend and mentor in Riften; guild connection and confidant.",
    "Olfrid Battle-Born": "Uneasy business patron in Whiterun; grants Guild foothold and retainer in exchange for family evacuation contingency."
  },
  "quests": [],
  "session_history": [],
  "notes": "Created during Session Zero\n- Contract: Escort Battle-Born family to Temple of Kynareth if Whiterun is breached. Retainer 1600 septims now; 1600 on completion/next day if no breach.\n- Foothold: 'Battle-Born Arcana' magic shop front with backroom safehouse; Olfrid receives 20% of clean shop revenue.\n- Heat: Thalmor search clock +1 from document/magic signature trail; Battle-Born Quiet Inquiry clock started.\n[Session 0 sheet readjustment] Skills swapped: Survival->Burglary, Empathy->Resources, Crafts->Contacts. Stunt swap: Spell of Muffle removed; Spell of Shadow Ward added. New stunt added: Spell of Clairvoyance (Refresh spent).\nMid-session: Slew Galmar Stone-Fist in west-wall fog; recovered his war-knot signet wrap and field marks; Stormcloak line routed.\nA1-S6: Olfrid paid remainder + bonus; Arcana front chartered; Guild foothold in Whiterun completed.\n[2026-02-05 Mid-Session] Battle of Whiterun resolved (Imperial victory). Galmar Stone-Fist taken out. Hadvar stabilized via Restoration. Contract paid (3,000g) + 500g bonus; evidence collected. Milestones earned: 1 Minor + 1 Significant (banked).\n[2026-02-09] Honningbrew: Clarified rules—tie on Overcome = success at minor cost; spent 1 FP to upgrade a prior tie into a clean success (no trace). Used Phantom Weaponry (conjured dagger) and Create Advantage with Deceive; invoked 'Great War Veteran - Former Penitus Oculatus (Phantom Blade)' for spycraft (spent 1 FP). Success with Style created aspect 'Sabjorn's Poison Kit' with 2 free invokes; staged poison/notes for Justiciar discovery and imminent seizure.\n[2026-02-09] Honningbrew: Merged escape + misdirection. Shadow Ward used to vanish (2 zones). Spent 1 FP invoking High Concept to mask arcane residue; Thalmor Justiciar failed to detect/track the magical exit (Overcome failed vs Fantastic opposition). Spent Boost 'Surgical Silence' to aid Mallus's Deceive while leading the Justiciar to staged evidence.\n[2026-02-09] Dampened Spirits turn-in at Bee and Barb: Maven pleased with clean execution; quest completed; Mallus preserved and extracted under Black-Briar protection. Maven provided Arisann lead: Ivory Thread courier lattice operates through The Pale; contact Hroldar 'Whitefin' at Nightgate Pass; passphrase exchange: 'salt survives the mirror' / reply 'then don't blink'. Spent 1 FP invoking High Concept during negotiation. Payout: +600 septims.\n[2026-02-12] Session 04: Divined Whitefin's likely hideout as a 'decrepit fortress overlooking Dawnstar' — treat as Nightcaller Temple approach unless contradicted.",
  "faction_alignment": "neutral",
  "additional_faction_interests": "Thieves Guild, College of Winterhold, The Imperial Legion."
}